{
    "hero_name": "Doctor Strange",
    "real_name": "Stephen Vincent Strange",
    "about_1": "Doctor Stephen Vincent Strange, M.D., Ph.D is a Master of the Mystic Arts. Originally being a brilliant but arrogant neurosurgeon, Strange got into a car accident which resulted with his hands becoming crippled. Once Western medicine failed him, Strange embarked on a journey to Kamar-Taj, where he was trained by the Ancient One in the ways of Magic and the Multiverse. Although he focused on healing his hands, Strange was drawn into a conflict with Kaecilius and the Zealots, who were working for Dormammu and had sought to merge Earth with the Dark Dimension to find an eternal life. Following the demise of the Ancient One and the defeat of Kaecilius, Strange then became the new protector for the Sanctum Sanctorum, seeking to defend the Earth from other inter-dimensional threats. From his new position, Strange aided Thor in locating Odin, before he learned of Thanos' attempts to gain all of the Infinity Stones and cause a universal genocide. Since Strange was the protector of the Time Stone, he was attacked and captured by Thanos' Black Order, only for him to then be rescued by Iron Man and Spider-Man. Having also been joined by the Guardians of the Galaxy, Strange battled against Thanos. However, as Strange had seen into the future and knew his only path to victory, he had willingly handed over the Time Stone, allowing Thanos to enact the Snap, killing Strange and trillions of other lives. However, Strange and all the rest of Thanos' victims had been resurrected five years later by the Avengers, and battled against an alternate Thanos, which resulted with Iron Man sacrificing his life to save the universe.",
    "about_2": "Strange offered his aid to Spider-Man, whose identity of Peter Parker was unmasked by Mysterio, as he asked Strange to make the world forget this. However, due to Parker's interference, the spell soon went wrong, and Strange inadvertently unleashed enemies of Spider-Man from across the Multiverse. Capturing these enemies, Strange tried to use the Macchina di Kadavus to send them to their universes to meet their inevitable fates, which Spider-Man had refused to allow, hoping to give these people a chance at redemption. Having been trapped in the Mirror Dimension, Strange then returned and fought to contain the Multiversal rift. With no other choice, Strange cast a spell to return the visitors back to their universes and close the rifts, but also at the cost of making everyone, including himself, forget Parker's existence. Being heralded of new interdimensional threats, Strange came across America Chavez, a teenager with the ability to travel through the Multiverse. While investigating these threats, Strange learned that Wanda Maximoff, who fell under the influence of the Darkhold, was responsible. As Kamar-Taj fell under attack by her, Chavez sent Strange spiraling through the multiverse, where they were eventually arrested by the Illuminati. With the help of a Palmer-counterpart, Strange and Chavez located the Darkhold's antithetical, the Book of Vishanti, only for Maximoff to destroy it and abduct Chavez, banishing Strange and Palmer to an incursioned universe. Confronting that reality's Doctor Strange, Strange claimed the Darkhold to utilize dreamwalking in order to rescue Chavez. Helping her gain full control of her powers, the two swayed Maximoff from the Darkhold's influence, before her apparent self-sacrifice to destroy all copies of the Darkhold throughout the Multiverse. In the aftermath, Strange and Wong took Chavez, who decided to stay in their universe, under their care and teach her in the Mystic Arts. Sometime later, Strange was confronted by Clea, a sorceress who enlisted his help in fixing a new incursion.",
    "about_source": "https://marvelcinematicuniverse.fandom.com/wiki/Doctor_Strange",
    "quote": "\"It is Doctor Strange! Not Master Strange, not Mr. Strange, Doctor Strange! When I became a doctor, I swore an oath to do no harm, and I have just killed a man! I'm not doing that again. I became a doctor to save lives, not take them.\"",
    "primary_rgb": "28,10,52",
    "strengths": ["Very well versed in many formes of magic", "Wise"],
    "weaknesses": ["Sometimes has an inflated ego", "Tries to do everything himself"]
}