{
    "hero_name": "Garfield",
    "real_name": "Garfield Arbuckle",
    "about_1": "Garfield was born on June 19, 1978, in the kitchen of Mamma Leoni's Italian Restaurant to his mother and his unnamed father, weighing 5 lbs and 6 ounces at birth. He has loved lasagna since the day he was born, and it has always been his favorite food ever since, unlike the majority of his family, even his parents, who were rodent preying \"mousers\". The restaurant owner of Mamma Leoni's Italian Restaurant had to choose between keeping Garfield or closing down his restaurant due to a lack of pasta, so Garfield was sold to a pet shop. On the same day as his birth, Jon Arbuckle came to the pet store and had to choose between Garfield, an iguana, and a pet rock. On November 14, 1978, comic strip, Jon quoted, \"I love cats. I wanted a cat... So what do I do? I go to the pet store and ask for a cat. What do they give me?... A lasagna with fur and fangs.\" Garfield is an overweight, anthropomorphic orange tabby cat noted for his sheer laziness, sarcasm, arrogance, selfishness, and intense passion for food, particularly lasagna and most forms of foods made from flour. He dislikes raisins and (sometimes) anchovy pizza. Throughout the course of the strip, Garfield's weight has been poked fun at as an object of ridicule, frequently by the electronic scale which he uses to weigh himself. Garfield usually does not handle insults or commands from the talking scale RX-2 (or anybody else) very well, and will normally respond to such remarks with either a saucy comeback or some sort of threat of violence, in spite of the fact that the character solely communicates through thought bubbles.",
    "about_2": "Garfield lives with his nerdy, socially awkward owner Jon Arbuckle and Jon's dimwitted pet dog Odie, and derives pleasure from satirically mocking the stupid actions performed by the two of them. Garfield seems to intensely abhor Odie (as obviously expected from the assumed common hatred shared by cats and dogs) and derives joy from causing him physical harm or insulting him such as kicking him off tables, seldom showing empathy for the beagle. Albeit Odie shows Garfield no belligerence of any kind and would never deliberately cause him harm (though Odie does occasionally prank Garfield and has made fun of his weight and more recently his age), Garfield despises him nonetheless and is apt to make rude and saucy comments based on the utter lack of intelligence displayed by Odie, though at times it is not entirely clear whether Odie actually is stupid or not. Odie is not the only target of Garfield's taunts; he frequently insults and pokes fun at Jon as well for his nerdy behavior and unpopularity with women, along with his unconventional and eccentric fashion sense. Despite his sometimes selfishness and sheer laziness, Garfield loves both Odie and Jon nonetheless, as well as his beloved teddy bear Pooky, which is frequently seen in his Garfield's arms or close to him. Nermal is disliked by Garfield, as he persistently claims to be cuter than him. Garfield also dislikes how Jon pays more attention to Nermal when the latter visits. In The Garfield Live action Film duology, he notably acts the same as he does in the comics, but has more of a passion towards dancing and listening to music. In The Garfield Show, while Garfield still retains his signature traits, he is considerably more compassionate towards his friends.",
    "about_source": "https://garfield.fandom.com/wiki/Garfield_(character)",
    "quote": "\"I hate Mondays.\"",
    "primary_rgb": "252,115,0",
    "strengths": ["Eating lasagne", "Sleeping"],
    "weaknesses": ["Morbidly obese", "Mondays"]
}